-- 1 without indexes
EXPLAIN (ANALYZE) SELECT Н_ЛЮДИ.ИД AS "id человека", Н_ВЕДОМОСТИ.ЧЛВК_ИД AS "id в ведомости"
FROM Н_ЛЮДИ
LEFT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE
    Н_ЛЮДИ.ИД > 100865 AND
    Н_ВЕДОМОСТИ.ДАТА < '2022-06-08';

-- 2 without indexes
EXPLAIN (ANALYZE) SELECT 
    Н_ЛЮДИ.ИД AS "id человека",
    Н_ВЕДОМОСТИ.ИД AS "id ведомости",
    Н_СЕССИЯ.ДАТА AS "дата сессии"
FROM Н_ЛЮДИ
LEFT JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
LEFT JOIN Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
WHERE
    Н_ЛЮДИ.ИД < 152862 AND
    Н_ВЕДОМОСТИ.ДАТА = '2022-06-08';